'''
Дана строка текста, состоящая из букв русского алфавита "О" и "Р". Буква "О" соответствует выпадению Орла, а буква "Р" - выпадению Решки. Напишите программу, которая подсчитывает наибольшее количество подряд выпавших Решек.

Формат входных данных
На вход программе подается строка текста, состоящая из букв русского алфавита "О" и "Р".

Формат выходных данных
Программа должна вывести наибольшее количество подряд выпавших Решек.
'''
sp = list(input())
ch = 0
max = 0
for i in sp:
    if i == "Р":
        ch += 1
        if ch > max:
            max = ch
    else:
        ch = 0
print(max)