'''
Формат входных данных
На вход программе подаются две строки текста, содержащие по одному слову из перечня "камень", "ножницы", "бумага", "ящерица" или "Спок". На первой строке записан выбор Тимура, на второй – выбор Руслана.

Формат выходных данных
Программа должна вывести результат жеребьёвки: кто победил - Тимур или Руслан, или они сыграли вничью.
'''
tim, rus = input(), input()
var = ['камень', 'ножницы', 'бумага', 'ящерица', 'Спок']
if var.index(tim) == var.index(rus):
    print('ничья')
elif ((tim==var[0]) and ((rus==var[1]) or (rus==var[3]))) or ((tim==var[1]) and ((rus==var[2]) or (rus==var[3]))) or ((tim==var[2]) and ((rus==var[0]) or (rus==var[4]))) or ((tim==var[3]) and ((rus==var[2]) or (rus==var[4]))) or ((tim==var[4]) and ((rus==var[1]) or (rus==var[0]))):
    print('Тимур')
else:
    print('Руслан')